<!-- 个人中心 -->
<template>
  <div class="page page_user">
    <!-- 标题 -->
    <!-- <div class="title">用户</div> -->
    <div class="flex items-center justify-between h-[0.98rem] mt-[0.28rem] mb-[0.2rem]">
      <div
        v-if="token"
        class="flex items-center justify-center -ml-[0.08rem] gap-[0.16rem]"
      >
        <div class="default-avatar"></div>
        <div>
          <div class="text-[#061023] text-[0.32rem] mb-[0.1rem]">
            {{ userInfo.username || "--" }}
          </div>
          <div class="text-[#666D80] text-[0.28rem]">
            ID:{{ userInfo.uid || "--" }}
          </div>
        </div>
      </div>
      <div
        v-else
        class="flex items-center -ml-[0.08rem] gap-[0.16rem]"
        @click="store.commit('setIsLoginOpen', true)"
      >
        <div class="default-avatar"></div>
        <div class="text-[0.32rem]">登录/注册</div>
      </div>
      <div class="flex items-center justify-center gap-[0.16rem]">
        <div
          @click="jump('chat', false)"
          class="w-[0.72rem] h-[0.72rem] rounded-[50%] border-[#EDF2F7] border-[0.02rem] flex items-center justify-center"
        >
          <div class="w-[0.4rem] h-[0.4rem]">
            <img src="/static/img/user/serverB.svg" alt="server" />
          </div>
        </div>
        <div
          class="w-[0.72rem] h-[0.72rem] rounded-[50%] border-[#EDF2F7] border-[0.02rem] flex items-center justify-center"
        >
          <div class="setting-icon"></div>
        </div>
      </div>
    </div>
    <div
      class="flex items-center bg-[#F5F7FC] rounded-[0.32rem] w-full h-[1.22rem] mb-[0.2rem]"
    >
      <div class="w-1/3 text-center">
        <div class="font-bold text-[#061023] text-[0.32rem] mb-[0.12rem]">
          0
        </div>
        <div class="text-[0.24rem] text-[#8f92a1]">推荐用户</div>
      </div>
      <div class="w-1/3 text-center">
        <div class="font-bold text-[#061023] text-[0.32rem] mb-[0.12rem]">
          0
        </div>
        <div class="text-[0.24rem] text-[#8f92a1]">网络用户</div>
      </div>
      <div class="w-1/3 text-center">
        <div class="font-bold text-[#061023] text-[0.32rem] mb-[0.12rem]">
          0
        </div>
        <div class="text-[0.24rem] text-[#8f92a1]">推荐奖金</div>
      </div>
    </div>
    <div>
      <!-- @click=" token ? jump('register', false, { guest: 1 }) : jump('kyc') -->
      <Carousel
        :autoplay="3000"
        :wrap-around="true"
        :mouseDrag="true"
        v-model="currentSlide"
        class="relative"
      >
        <Slide v-for="(slide, index) in slides" :key="index">
          <img :src="slide" class="w-full rounded-[0.36rem]" alt="img" />
          <div class="absolute left-0 ml-[0.32rem]">
            <div class="text-white text-[0.3rem] font-bold mb-[0.2rem]">
              领取投资模拟金
            </div>
            <div class="text-white text-[0.24rem]">模拟投资，收益在手</div>
          </div>
        </Slide>
      </Carousel>
      <div class="flex gap-[0.05rem] justify-center relative -mt-[0.2rem]">
        <div
          class="w-[0.2rem] h-[0.06rem] rounded-[1rem] bg-white"
          :class="[currentSlide == 0 ? '' : 'opacity-50']"
        ></div>
        <div
          class="w-[0.2rem] h-[0.06rem] rounded-[1rem] bg-white"
          :class="[currentSlide == 1 ? '' : 'opacity-50']"
        ></div>
      </div>
    </div>
    <div
      class="flex items-center w-full mb-[0.4rem] mt-[0.56rem] justify-between"
    >
      <div
        @click="jump('account', true)"
        class="text-center flex flex-col items-center justify-center relative"
      >
        <div
          class="w-[0.8rem] h-[0.8rem] rounded-[0.32rem] bg-[#014CFA] opacity-10 mb-[0.2rem]"
        ></div>
        <div
          class="absolute w-[0.48rem] h-[0.48rem] opacity-100 top-0 mt-[0.16rem]"
        >
          <img class="" src="/static/img/user/payment.svg" />
        </div>
        <div class="text-[#061023] text-[0.28rem]">收款账户</div>
      </div>
      <div
        @click="jump('kyc', true)"
        class="text-center flex flex-col items-center justify-center relative"
      >
        <div
          class="w-[0.8rem] h-[0.8rem] rounded-[0.32rem] bg-[#014CFA] opacity-10 mb-[0.2rem]"
        ></div>
        <div
          class="absolute w-[0.55rem] h-[0.6rem] opacity-100 top-0 mt-[0.1rem]"
        >
          <img class="" src="/static/img/user/id_card.svg" />
        </div>
        <div
          v-if="token"
          class="absolute top-0 ml-[1rem] -mt-[0.03rem] text-white text-[0.22rem] w-[0.76rem] h-[0.32rem] rounded-[1.2rem] flex items-center justify-center"
          :class="[
            userInfo.kycl2 == 0
              ? 'bg-[#E8503A]'
              : `${userInfo.kycl2 == 1 ? 'bg-[#014CFA]' : 'bg-[#18B762]'}`,
          ]"
        >
          <span v-if="userInfo.kycl2 == 0">未认证</span>
          <span v-else-if="userInfo.kycl2 == 1">待审核</span>
          <span v-else>已认证</span>
        </div>
        <div class="text-[#061023] text-[0.28rem]">身份认证</div>
      </div>
      <div
        @click="jump('googleCode', true)"
        class="text-center flex flex-col items-center justify-center relative"
      >
        <div
          class="w-[0.8rem] h-[0.8rem] rounded-[0.32rem] bg-[#014CFA] opacity-10 mb-[0.2rem]"
        ></div>
        <div
          class="absolute w-[0.48rem] h-[0.48rem] opacity-100 top-0 mt-[0.16rem]"
        >
          <img class="" src="/static/img/user/google.svg" />
        </div>
        <div
          v-if="token"
          class="absolute top-0 ml-[1rem] -mt-[0.03rem] text-white text-[0.22rem] w-[0.76rem] h-[0.32rem] rounded-[1.2rem] flex items-center justify-center"
          :class="[userInfo.googlebind == 0 ? 'bg-[#E8503A]' : 'bg-[#18B762]']"
        >
          <span v-if="userInfo.googlebind == 0">未认证</span>
          <span v-else>已绑定</span>
        </div>
        <div class="text-[#061023] text-[0.28rem]">谷歌验证器</div>
      </div>
      <div
        class="text-center flex flex-col items-center justify-center relative"
      >
        <div
          class="w-[0.8rem] h-[0.8rem] rounded-[0.32rem] bg-[#014CFA] opacity-10 mb-[0.2rem]"
        ></div>
        <div
          class="absolute w-[0.48rem] h-[0.48rem] opacity-100 top-0 mt-[0.16rem]"
        >
          <img class="" src="/static/img/user/friend.svg" />
        </div>
        <div class="text-[#061023] text-[0.28rem]">推荐朋友</div>
      </div>
    </div>

    <div class="navs">
      <div class="nav" @click="jump('language')">
        <div class="language-icon mr-[0.16rem]"></div>
        <div class="content">
          <div class="title">语言</div>
        </div>
        <div class="lang">
          <div class="lang_icon">
            <img :src="i18Data.icon" alt="English" />
          </div>
          <span class="font-1">{{ i18Data.name }}</span>
        </div>
        <Icon class="nav_more" size="0.32rem" name="arrow" />
      </div>
      <div class="nav" @click="jump('safety', true)">
        <div class="verify-icon mr-[0.16rem]"></div>
        <div class="content">
          <div class="title">安全</div>
        </div>
        <div v-if="token" class="gg">
          <span v-if="!userInfo.googlebind" style="color: #ff3b30"
            >谷歌验证器未绑定</span
          >
          <span v-if="userInfo.googlebind" style="color: #18b762"
            >谷歌验证器已绑定</span
          >
        </div>
        <Icon class="nav_more" size="0.32rem" name="arrow" />
      </div>
      <div class="nav" @click="jump('about')">
        <div class="info-icon mr-[0.16rem]"></div>
        <div class="content">
          <div class="title">关于</div>
        </div>
        <Icon class="nav_more" size="0.32rem" name="arrow" />
      </div>
    </div>

    <!-- 退出登录 -->
    <div v-if="token" class="loginout" @click="loginout">退出登录</div>
  </div>
</template>

<script setup>
import { computed, watch, ref } from "vue";
import { Icon, showConfirmDialog } from "vant";
import router from "@/router";
import store from "@/store";
import storeChat from "@/store/chat";
import { _logout } from "@/api/api";
import "vue3-carousel/dist/carousel.css";
import { Carousel, Slide, Pagination, Navigation } from "vue3-carousel";
const messageNum = computed(() => storeChat.state.messageNum);
const token = computed(() => store.state.token);
const userInfo = computed(() => store.state.userInfo || {});
const i18Data = computed(() => store.state.i18Data || {});
const slides = ["/static/img/user/userid.webp", "/static/img/user/userid.webp"];
const currentSlide = ref(0);
const getFirstCharacter = (username) => {
  return username ? username.charAt(0) : "-";
};

const loginout = () => {
  if (token.value) {
    showConfirmDialog({
      title: "退出登录",
      message: "您当前确定要退出吗？",
      confirmButtonColor: "#014CFA",
      cancelButtonColor: "#323233",
    })
      .then(() => {
        _logout();
        setTimeout(() => {
          store.dispatch("reset");
          store.commit("setIsLoginOpen", true);
          // router.push({
          //     name: 'login'
          // })
        }, 200);
      })
      .catch(() => {});
  }
};

const jump = (name, needLogin, query) => {
  if (needLogin && !token.value) {
    store.commit("setIsLoginOpen", true);
    return;
  }
  if (name == "googleCode") {
    if (token.value && !userInfo.value.googlebind) {
      router.push({
        name: "google",
        query,
      });
    } else if (token.value && userInfo.value.googlebind) {
      router.push({
        name: "googleCode",
        query,
      });
    }
  } else {
    router.push({
      name,
      query,
    });
  }
};

// 预加载页面
store.commit("setPageLoading", true);
const loadingList = [import("@/views/Public/Language.vue")];
if (!token.value) {
  loadingList.push(import("@/views/Public/Login.vue"));
}
Promise.all(loadingList).finally(() => {
  store.commit("setPageLoading", false);
});

// 延迟加载
if (token.value) {
  setTimeout(() => {
    store.commit("setPageLoading", false);
    Promise.all([
      import("@/views/User/Safety.vue"),
      import("@/views/User/Account/Account.vue"),
      import("@/views/User/Kyc/Index.vue"),
    ]);
  }, 1000);
}
</script>

<style lang="less" scoped>
.page_user {
  padding: 0 0.32rem 2rem 0.32rem;
  position: relative;
  height: 100%;
  overflow-y: auto;

  .title {
    height: 1.12rem;
    color: #0d0d12;
    font-size: 0.5rem;
    font-weight: 600;
    line-height: 1.12rem;
  }


  .loginout {
    width: 100%;
    height: 1.04rem;
    border-radius: 0.32rem;
    background-color: #f5f7fc;
    display: flex;
    align-items: center;
    justify-content: center;
    color: #666d80;
  }

  .navs {
    margin-bottom: 0.8rem;
    .nav {
      display: flex;
      align-items: center;
      height: 1.04rem;
      color: #061023;
      font-size: 0.3rem;
      overflow: hidden;
      background-color: #f5f7fc;
      border-radius: 0.32rem;
      padding-inline: 0.32rem;
      margin-bottom: 0.2rem;
      .icon {
        margin-right: 0.16rem;
        width: 0.64rem;
        height: 0.64rem;
        border-radius: 50%;
        display: flex;
        align-items: center;
        justify-content: center;

        > img {
          width: 0.48rem !important;
          height: 0.48rem !important;
        }
      }

      .content {
        flex: 1;
        font-weight: 400;
        overflow: hidden;

        .title {
          color: #1e1e2d;
          font-size: 0.3rem;
          font-weight: 400;
        }

        .info {
          font-size: 0.24rem;
          color: #c2c2c2;
          margin-top: 0.2rem;
        }
      }

      .nav_more {
        margin-left: 0.12rem;
        color: #666d80;
        font-size: 0.32rem;
      }

      .cards {
        width: 1.36rem;
        height: 0.52rem;
      }

      .gg {
        font-weight: 500;
        font-size: 0.3rem;
      }

      .lang {
        display: flex;
        align-items: center;
        font-weight: 500;
        color: #1e1e2d;

        .lang_icon {
          width: 0.52rem;
          height: 0.52rem;
          margin-right: 0.16rem;
        }
        .font-1 {
          font-size: 0.3rem;
        }
      }
    }
  }
}
.default-avatar {
  width: 0.98rem;
  height: 0.98rem;
  background-image: url('data:image/svg+xml;utf8,<svg width="49" height="49" viewBox="0 0 49 49" fill="none" xmlns="http://www.w3.org/2000/svg"><circle cx="24.5" cy="24.5" r="24.5" fill="%23014CFA" fill-opacity="0.1"/><path d="M2 24.5C2 36.9226 12.0773 47 24.5 47C36.9226 47 47 36.9226 47 24.5C47 12.0773 36.9226 2 24.5 2C12.0773 2 2 12.0768 2 24.5Z" fill="%236C8CD6"/><path d="M21.1109 30.5918H28.1698V36.4168H21.0875L21.1109 30.5918ZM16.6293 22.794C16.6293 23.8301 16.0025 24.6695 15.213 24.6695C14.4236 24.6695 13.7988 23.8301 13.7988 22.794C13.7988 21.758 14.4257 20.9191 15.2151 20.9191C16.0045 20.9191 16.6313 21.7585 16.6313 22.794M35.5089 22.768C35.5089 23.8036 34.8816 24.643 34.0921 24.643C33.3027 24.643 32.6744 23.802 32.6744 22.768C32.6744 21.734 33.3012 20.8926 34.0906 20.8926C34.88 20.8926 35.5089 21.7585 35.5089 22.768Z" fill="%23F8ECEC"/><path d="M21.1104 31.4277C21.1104 31.4277 22.4573 32.124 24.3842 32.124C26.6597 32.2172 28.1458 31.4512 28.1458 31.4512V32.1475C28.1458 32.1475 25.6384 33.4932 24.5239 33.4932C23.3859 33.4932 21.1094 31.9142 21.1094 31.9142L21.1104 31.4277Z" fill="%23E9CFCF"/><path d="M40.9156 39.8521C39.7781 38.947 37.7458 36.3885 35.6094 35.3667C32.1496 33.6726 28.1449 34.1667 28.1449 34.1667V34.2803C27.8661 34.5823 26.4963 35.928 24.6387 35.928C22.804 35.928 21.4112 34.675 21.1095 34.349L21.0861 34.1865C21.0861 34.1865 16.6686 33.6695 13.1869 35.3637C10.8186 36.5245 9.12922 39.0601 8.10742 39.9418C10.2042 42.1793 12.7398 43.9608 15.5561 45.1753C18.3724 46.3898 21.4089 47.0111 24.4761 47.0005C30.9779 46.9771 36.8289 44.2387 40.9156 39.8521Z" fill="%23485B80"/><path d="M33.8572 21.2681C33.8572 23.6687 33.1304 26.922 31.9104 28.6798C30.2286 31.1023 26.436 32.2218 24.662 32.2218C22.8686 32.2218 19.4562 31.3086 17.7723 29.1657C16.3372 27.3386 15.4668 23.8953 15.4668 21.2706C15.4668 15.5617 19.5769 10.9199 24.662 10.9199C29.747 10.9199 33.8572 15.5617 33.8572 21.2706" fill="%23F8ECEC"/><path d="M34.6712 16.5275C34.6712 16.5275 34.5912 12.9539 32.5527 10.4071C31.1288 8.6284 26.5901 7.33717 23.3397 7.59287C23.3397 7.59287 16.9729 7.84755 16.8404 12.0752C15.677 12.7715 14.4814 13.9726 14.3535 15.9912C14.0987 20.0528 14.8177 21.1204 14.8177 21.1204C14.8177 21.1204 15.8395 21.1204 16.0954 22.6516C16.0954 22.6516 16.5596 22.9307 16.605 22.6516C16.6743 22.1875 16.1871 19.9596 17.162 17.9176C17.2823 17.6593 17.4026 17.4291 17.5188 17.2238C20.7111 13.6746 30.0744 14.0424 32.2684 17.9232C32.3582 18.1933 32.4232 18.471 32.4625 18.7529C32.648 20.0773 32.8804 22.5823 32.8804 22.5823C32.8804 22.5823 33.2285 22.8141 33.4609 22.2573C33.6933 21.6772 33.6469 21.1204 33.8558 20.958C35.0423 20.17 34.7406 16.8759 34.6712 16.5275Z" fill="%23485B80"/></svg>');
  background-size: contain;
  background-repeat: no-repeat;
}
.setting-icon {
  width: 0.48rem;
  height: 0.48rem;
  background-image: url('data:image/svg+xml;utf8,<svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M22.1365 11.0525L17.8625 3.30255C17.7137 3.03111 17.4948 2.80457 17.2286 2.64657C16.9625 2.48857 16.6588 2.4049 16.3492 2.4043H7.86173C7.5522 2.4049 7.2485 2.48857 6.98232 2.64657C6.71615 2.80457 6.49725 3.03111 6.34848 3.30255L2.07448 11.0525C1.93081 11.3134 1.85547 11.6065 1.85547 11.9043C1.85547 12.2021 1.93081 12.4951 2.07448 12.756L6.34848 20.506C6.49725 20.7775 6.71615 21.004 6.98232 21.162C7.2485 21.32 7.5522 21.4037 7.86173 21.4043H16.3492C16.6588 21.4037 16.9625 21.32 17.2286 21.162C17.4948 21.004 17.7137 20.7775 17.8625 20.506L22.1365 12.756C22.2802 12.4951 22.3555 12.2021 22.3555 11.9043C22.3555 11.6065 22.2802 11.3134 22.1365 11.0525ZM20.8242 11.7825C20.8447 11.8198 20.8555 11.8616 20.8555 11.9042C20.8555 11.9467 20.8447 11.9885 20.8242 12.0258L16.5577 19.7758C16.5366 19.8146 16.5054 19.847 16.4674 19.8696C16.4295 19.8922 16.3862 19.9042 16.342 19.9043H7.86898C7.82481 19.9042 7.78147 19.8922 7.74352 19.8696C7.70556 19.847 7.67438 19.8146 7.65323 19.7758L3.38673 12.0258C3.36625 11.9885 3.35551 11.9467 3.35551 11.9042C3.35551 11.8616 3.36625 11.8198 3.38673 11.7825L7.65323 4.03255C7.67441 3.99381 7.70561 3.96147 7.74356 3.93891C7.78151 3.91635 7.82483 3.90439 7.86898 3.9043H16.342C16.3861 3.90439 16.4294 3.91635 16.4674 3.93891C16.5054 3.96147 16.5366 3.99381 16.5577 4.03255L20.8242 11.7825ZM12.041 8.0008C9.83173 8.0008 8.04098 9.79155 8.04098 12.0008C8.04098 14.21 9.83173 16.0008 12.041 16.0008C14.25 16.0008 16.041 14.21 16.041 12.0008C16.041 9.79155 14.25 8.0008 12.041 8.0008ZM12.041 9.5008C13.4217 9.5008 14.541 10.62 14.541 12.0008C14.541 13.3815 13.4217 14.5008 12.041 14.5008C10.6602 14.5008 9.54098 13.3815 9.54098 12.0008C9.54098 10.62 10.6602 9.5008 12.041 9.5008Z" fill="black"/></svg>');
  background-size: contain;
  background-repeat: no-repeat;
}
.payment-icon {
  width: 24px;
  height: 24px;
  background-image: url('data:image/svg+xml;utf8,<svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg"><g clip-path="url(#clip0_481_5165)"><path d="M2.1445 1.27734H21.445C22.0138 1.27734 22.5592 1.50328 22.9614 1.90545C23.3636 2.30763 23.5895 2.85309 23.5895 3.42185V7.71085H0V3.42185C0 2.85309 0.225938 2.30763 0.62811 1.90545C1.03028 1.50328 1.57575 1.27734 2.1445 1.27734ZM0 9.85535H23.5895V20.5779C23.5895 21.1466 23.3636 21.6921 22.9614 22.0943C22.5592 22.4964 22.0138 22.7224 21.445 22.7224H2.1445C1.57575 22.7224 1.03028 22.4964 0.62811 22.0943C0.225938 21.6921 0 21.1466 0 20.5779L0 9.85535ZM13.5816 17.7188V19.8633H15.7261V17.7188H13.5816ZM16.4415 17.7188V19.8633H18.586V17.7188H16.4415ZM19.3005 17.7188V19.8633H21.445V17.7188H19.3005Z" fill="url(#paint0_linear_481_5165)"/><mask id="mask0_481_5165" style="mask-type:alpha" maskUnits="userSpaceOnUse" x="0" y="1" width="24" height="22"><path d="M2.1445 1.27734H21.445C22.0138 1.27734 22.5592 1.50328 22.9614 1.90545C23.3636 2.30763 23.5895 2.85309 23.5895 3.42185V7.71085H0V3.42185C0 2.85309 0.225938 2.30763 0.62811 1.90545C1.03028 1.50328 1.57575 1.27734 2.1445 1.27734ZM0 9.85535H23.5895V20.5779C23.5895 21.1466 23.3636 21.6921 22.9614 22.0943C22.5592 22.4964 22.0138 22.7224 21.445 22.7224H2.1445C1.57575 22.7224 1.03028 22.4964 0.62811 22.0943C0.225938 21.6921 0 21.1466 0 20.5779L0 9.85535ZM13.5816 17.7188V19.8633H15.7261V17.7188H13.5816ZM16.4415 17.7188V19.8633H18.586V17.7188H16.4415ZM19.3005 17.7188V19.8633H21.445V17.7188H19.3005Z" fill="#014CFA"/></mask><g mask="url(#mask0_481_5165)"><rect x="12.79" y="-17" width="16" height="42" transform="rotate(37.8828 12.79 -17)" fill="white" fill-opacity="0.1"/></g></g><defs><linearGradient id="paint0_linear_481_5165" x1="11.9667" y1="1.98046" x2="10.1825" y2="22.5737" gradientUnits="userSpaceOnUse"><stop stop-color="%236794FB"/><stop offset="1" stop-color="%23014CFA"/></linearGradient><clipPath id="clip0_481_5165"><rect width="24" height="24" fill="white"/></clipPath></defs></svg>');
  background-size: contain;
  background-repeat: no-repeat;
}
.language-icon {
  width: 0.48rem;
  height: 0.48rem;
  background-image: url('data:image/svg+xml;utf8,<svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M2 12C2 6.47709 6.47709 2 12 2C17.5229 2 22 6.47709 22 12C22 17.5229 17.5229 22 12 22C6.47709 22 2 17.5229 2 12ZM12 3.50406C10.6699 3.50386 9.35838 3.81595 8.17094 4.4152C6.98351 5.01445 5.95336 5.88413 5.16342 6.95423C4.37348 8.02432 3.84582 9.26494 3.62292 10.5762C3.40002 11.8875 3.4881 13.2328 3.88008 14.5038C3.90663 14.5113 3.93274 14.5204 3.95829 14.5308C5.13145 15.0021 5.61075 14.8457 5.79926 14.6732C5.82232 14.6532 5.8875 14.5679 5.94265 14.2992C5.98676 14.0836 6.00782 13.845 6.03289 13.5552L6.05294 13.3316C6.08804 12.9706 6.13717 12.5304 6.27554 12.1304C6.41893 11.7132 6.68164 11.274 7.17999 11.0023C7.77559 10.6774 8.37822 10.8469 8.79134 11.0324C9.13025 11.1858 9.49022 11.4194 9.80006 11.62L9.98456 11.7393C10.3696 11.985 10.6895 12.1664 10.9812 12.2527C11.244 12.3309 11.4325 12.3159 11.612 12.2156C11.691 12.1773 11.7596 12.1204 11.812 12.0499C11.8644 11.9794 11.8989 11.8972 11.9128 11.8105C11.9609 11.5829 11.9449 11.2861 11.8947 10.8679C11.8875 10.8074 11.8802 10.7469 11.8727 10.6865C11.8295 10.3435 11.7764 9.92339 11.7924 9.54036C11.8155 9.05906 11.9509 8.49153 12.4442 8.06237C13.128 7.46776 13.9463 7.41863 14.4115 7.39055C14.4807 7.38755 14.5419 7.38354 14.593 7.37852C14.8427 7.35546 14.8978 7.32037 14.9079 7.31335L14.9099 7.31134L14.9129 7.30833C14.9199 7.29931 14.926 7.28956 14.9309 7.27925C14.9683 7.19765 14.9926 7.1107 15.0031 7.02156C15.0272 6.86714 15.0262 6.77088 15.0202 6.71573C15.0184 6.69874 15.015 6.68196 15.0101 6.6656C15.0101 6.66058 15.0081 6.65657 15.0081 6.65657L15.0061 6.65457L15.0041 6.65156C14.9493 6.6051 14.8906 6.56349 14.8286 6.52722L14.7715 6.49413C14.5376 6.36508 14.3224 6.20486 14.1318 6.01785C13.851 5.72907 13.6474 5.34904 13.5542 4.83465V4.83064C13.4754 4.43167 13.4254 4.02753 13.4048 3.62138C12.9406 3.54368 12.4707 3.50445 12 3.50406ZM12 20.4959C12.3159 20.4959 12.6287 20.4779 12.9355 20.4448C12.6347 19.9525 12.3991 19.2817 12.4121 18.4494C12.4181 17.9942 12.4903 17.6162 12.6327 17.2933C12.7791 16.9624 12.9786 16.7388 13.1641 16.5713C13.2694 16.4755 13.3781 16.3836 13.49 16.2956C13.6134 16.1983 13.6464 16.1723 13.6946 16.0479C13.7247 15.9657 13.7467 15.8263 13.7567 15.5566L13.7608 15.4062C13.7678 15.1896 13.7748 14.9139 13.8109 14.6562C13.859 14.3193 13.9643 13.9202 14.236 13.5612C14.5168 13.1902 14.9219 12.9335 15.4413 12.7911C16.4701 12.5104 17.6172 12.7972 18.5527 13.2504C19.1409 13.5349 19.6852 13.9023 20.1691 14.3413C20.7591 12.281 20.5491 10.0738 19.5809 8.16183C18.6127 6.24984 16.9579 4.77421 14.948 4.03048C14.968 4.18089 14.9961 4.35937 15.0322 4.56392C15.0773 4.80959 15.1535 4.91286 15.2107 4.97202C15.2839 5.04723 15.3621 5.09435 15.5285 5.19463L15.6047 5.23975C15.7912 5.35305 16.1131 5.55059 16.3207 5.9246C16.5352 6.31064 16.5653 6.75885 16.4881 7.25419C16.4059 7.7786 16.2023 8.2238 15.8053 8.5196C15.4383 8.79234 15.0161 8.84949 14.7334 8.87556L14.4366 8.90163C13.9683 8.93874 13.7036 8.95979 13.4309 9.19743C13.3687 9.25058 13.3065 9.34383 13.2945 9.60854C13.2845 9.8512 13.3166 10.1159 13.3597 10.4608L13.3877 10.6895C13.4369 11.0986 13.489 11.625 13.3817 12.1263C13.2634 12.6768 13.0007 13.1591 12.3911 13.5001L12.3439 13.5291C11.7222 13.8761 11.0966 13.856 10.5531 13.6956C10.0377 13.5432 9.55841 13.2524 9.17437 13.0067L8.94174 12.8563C8.63592 12.6598 8.39727 12.5054 8.17367 12.4051C8.08794 12.3631 7.99573 12.336 7.90093 12.3249H7.89692C7.83375 12.359 7.76256 12.4282 7.69638 12.6217C7.62318 12.8322 7.58408 13.108 7.54998 13.471L7.53394 13.6515C7.51197 13.9696 7.47247 14.2862 7.41562 14.6C7.33942 14.971 7.19001 15.4393 6.81199 15.7852C6.22942 16.3167 5.47639 16.428 4.66921 16.2966C5.41828 17.5756 6.48908 18.6363 7.77516 19.3732C9.06123 20.1101 10.5178 20.4975 12 20.4969V20.4959ZM14.608 20.0878C16.748 19.395 18.5272 17.884 19.5574 15.8845C19.2065 15.4323 18.6008 14.945 17.8969 14.604C17.1148 14.225 16.3668 14.0977 15.8394 14.2421C15.5817 14.3122 15.4824 14.4065 15.4343 14.4697C15.3781 14.5449 15.329 14.6622 15.3009 14.8667C15.2768 15.0322 15.2728 15.1956 15.2668 15.3982L15.2598 15.6138C15.2498 15.8805 15.2287 16.2475 15.0984 16.5864C14.8888 17.1319 14.4506 17.4698 14.2521 17.6232C14.217 17.6503 14.1889 17.6723 14.1719 17.6874C14.1018 17.7451 14.0458 17.8182 14.0084 17.9009C13.9683 17.9922 13.9202 18.1596 13.9162 18.4715C13.9011 19.4261 14.4025 19.9404 14.5308 20.0277C14.5578 20.0461 14.5836 20.0662 14.608 20.0878Z" fill="%23666D80"/></svg>');
  background-size: contain;
  background-repeat: no-repeat;
}
.verify-icon {
  width: 0.48rem;
  height: 0.48rem;
  background-image: url('data:image/svg+xml;utf8,<svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M9.59048 11.181C9.44019 11.0307 9.23635 10.9462 9.02381 10.9462C8.81127 10.9462 8.60743 11.0307 8.45714 11.181C8.30685 11.3312 8.22242 11.5351 8.22242 11.7476C8.22242 11.9602 8.30685 12.164 8.45714 12.3143L11.3143 15.1714C11.4571 15.3139 11.6506 15.3939 11.8524 15.3939C12.0541 15.3939 12.2476 15.3139 12.3905 15.1714L17.381 10.181C17.5234 10.0381 17.6035 9.84461 17.6035 9.64286C17.6035 9.44111 17.5234 9.24759 17.381 9.10476L17.3143 9.03809C17.1715 8.89561 16.9779 8.81559 16.7762 8.81559C16.5744 8.81559 16.3809 8.89561 16.2381 9.03809L11.9238 13.5143L9.59048 11.181ZM19.5333 13.4286C19.5333 15.275 18.7998 17.0458 17.4942 18.3514C16.1886 19.657 14.4178 20.3905 12.5714 20.3905C10.725 20.3905 8.95423 19.657 7.64862 18.3514C6.34301 17.0458 5.60952 15.275 5.60952 13.4286V6.06667L12.5714 3.60952L19.5333 6.06667V13.4286ZM12.5714 2L4 4.85714V13.4286C4 15.7019 4.90306 17.882 6.51051 19.4895C8.11797 21.0969 10.2981 22 12.5714 22C14.8447 22 17.0249 21.0969 18.6323 19.4895C20.2398 17.882 21.1429 15.7019 21.1429 13.4286V4.85714L12.5714 2Z" fill="%23666D80"/></svg>');
  background-size: contain;
  background-repeat: no-repeat;
}
.info-icon {
  width: 0.48rem;
  height: 0.48rem;
  background-image: url('data:image/svg+xml;utf8,<svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M12 2C17.5229 2 22 6.47714 22 12C22 17.5229 17.5229 22 12 22C6.47714 22 2 17.5229 2 12C2 6.47714 6.47714 2 12 2ZM12 3.90476C7.52905 3.90476 3.90476 7.52905 3.90476 12C3.90476 16.471 7.52905 20.0952 12 20.0952C16.471 20.0952 20.0952 16.471 20.0952 12C20.0952 7.52905 16.471 3.90476 12 3.90476ZM12.4762 10.0952C12.5387 10.0952 12.6006 10.1076 12.6584 10.1315C12.7162 10.1554 12.7687 10.1905 12.8129 10.2347C12.8571 10.2789 12.8922 10.3314 12.9161 10.3892C12.9401 10.447 12.9524 10.5089 12.9524 10.5714V17.2381C12.9524 17.3006 12.9401 17.3626 12.9161 17.4203C12.8922 17.4781 12.8571 17.5306 12.8129 17.5748C12.7687 17.619 12.7162 17.6541 12.6584 17.678C12.6006 17.702 12.5387 17.7143 12.4762 17.7143H11.5238C11.4613 17.7143 11.3994 17.702 11.3416 17.678C11.2838 17.6541 11.2313 17.619 11.1871 17.5748C11.1429 17.5306 11.1078 17.4781 11.0839 17.4203C11.0599 17.3626 11.0476 17.3006 11.0476 17.2381V10.5714C11.0476 10.5089 11.0599 10.447 11.0839 10.3892C11.1078 10.3314 11.1429 10.2789 11.1871 10.2347C11.2313 10.1905 11.2838 10.1554 11.3416 10.1315C11.3994 10.1076 11.4613 10.0952 11.5238 10.0952H12.4762ZM12.4762 6.28571C12.5387 6.28571 12.6006 6.29803 12.6584 6.32196C12.7162 6.34589 12.7687 6.38097 12.8129 6.42519C12.8571 6.46941 12.8922 6.5219 12.9161 6.57968C12.9401 6.63745 12.9524 6.69937 12.9524 6.76191V7.71429C12.9524 7.77682 12.9401 7.83874 12.9161 7.89652C12.8922 7.95429 12.8571 8.00678 12.8129 8.051C12.7687 8.09522 12.7162 8.1303 12.6584 8.15423C12.6006 8.17816 12.5387 8.19048 12.4762 8.19048H11.5238C11.4613 8.19048 11.3994 8.17816 11.3416 8.15423C11.2838 8.1303 11.2313 8.09522 11.1871 8.051C11.1429 8.00678 11.1078 7.95429 11.0839 7.89652C11.0599 7.83874 11.0476 7.77682 11.0476 7.71429V6.76191C11.0476 6.69937 11.0599 6.63745 11.0839 6.57968C11.1078 6.5219 11.1429 6.46941 11.1871 6.42519C11.2313 6.38097 11.2838 6.34589 11.3416 6.32196C11.3994 6.29803 11.4613 6.28571 11.5238 6.28571H12.4762Z" fill="%23666D80"/></svg>');
  background-size: contain;
  background-repeat: no-repeat;
}
.googole_icon {
  background-image: url('data:image/svg+xml;charset=UTF-8,%3Csvg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg"%3E%3Cg clip-path="url(%23clip0_802_7212)"%3E%3Cpath d="M4.38491 2.72595C8.96626 -1.03643 15.6085 -0.88893 20.0184 3.07394L16.17 6.64683C15.1672 5.86632 13.9655 5.383 12.7015 5.25187C11.4376 5.12075 10.1622 5.34708 9.02057 5.90511C7.87893 6.46315 6.91686 7.33047 6.24388 8.40836C5.5709 9.48625 5.21403 10.7314 5.21388 12.0022C5.21114 13.6169 5.78451 15.1796 6.8309 16.4094C7.87729 17.6392 9.32807 18.4554 10.9224 18.7113C12.5167 18.9671 14.15 18.6458 15.5287 17.8052C16.9073 16.9645 17.9408 15.6596 18.4435 14.1251H12.0922V9.22025H23.6718C25.0442 14.9866 21.9993 20.8924 16.5045 23.1193C11.0102 25.3452 4.7134 23.2253 1.68449 18.129C-1.34441 13.0326 -0.196945 6.48833 4.38491 2.72595ZM12.1997 20.2884C12.0545 20.2885 11.9107 20.3171 11.7767 20.3727C11.6426 20.4283 11.5207 20.5098 11.4181 20.6125C11.3155 20.7152 11.2341 20.8371 11.1786 20.9713C11.1232 21.1054 11.0946 21.2492 11.0947 21.3944C11.0948 21.5395 11.1234 21.6833 11.179 21.8174C11.2346 21.9515 11.3161 22.0733 11.4188 22.1759C11.5215 22.2785 11.6434 22.3599 11.7776 22.4154C11.9117 22.4709 12.0555 22.4994 12.2007 22.4993C12.4938 22.4993 12.775 22.3829 12.9823 22.1755C13.1897 21.9682 13.3061 21.687 13.3061 21.3939C13.3061 21.1007 13.1897 20.8195 12.9823 20.6122C12.775 20.4049 12.4938 20.2884 12.2007 20.2884H12.1997ZM5.77636 17.5985C5.48324 17.5985 5.20213 17.7149 4.99486 17.9222C4.78759 18.1295 4.67115 18.4106 4.67115 18.7037C4.67115 18.9968 4.78759 19.2779 4.99486 19.4852C5.20213 19.6925 5.48324 19.8089 5.77636 19.8089C6.06949 19.8089 6.3506 19.6925 6.55787 19.4852C6.76514 19.2779 6.88158 18.9968 6.88158 18.7037C6.88158 18.4106 6.76514 18.1295 6.55787 17.9222C6.3506 17.7149 6.06949 17.5985 5.77636 17.5985ZM18.6795 17.5985C18.3863 17.5985 18.1052 17.7149 17.8979 17.9222C17.6907 18.1295 17.5742 18.4106 17.5742 18.7037C17.5742 18.9968 17.6907 19.2779 17.8979 19.4852C18.1052 19.6925 18.3863 19.8089 18.6795 19.8089C18.9726 19.8089 19.2537 19.6925 19.461 19.4852C19.6682 19.2779 19.7847 18.9968 19.7847 18.7037C19.7847 18.4106 19.6682 18.1295 19.461 17.9222C19.2537 17.7149 18.9726 17.5985 18.6795 17.5985ZM3.10495 11.1317C2.95981 11.1317 2.8161 11.1603 2.68202 11.2159C2.54794 11.2715 2.42612 11.3529 2.32352 11.4556C2.22091 11.5582 2.13953 11.6801 2.08402 11.8142C2.02851 11.9483 1.99995 12.092 1.99998 12.2371C2.00002 12.3823 2.02864 12.526 2.08421 12.6601C2.13978 12.7942 2.22122 12.916 2.32387 13.0186C2.42652 13.1212 2.54838 13.2026 2.68248 13.2581C2.81659 13.3136 2.96031 13.3421 3.10545 13.3421C3.39857 13.3421 3.67969 13.2257 3.88695 13.0184C4.09422 12.8111 4.21066 12.53 4.21066 12.2369C4.21066 11.9438 4.09422 11.6627 3.88695 11.4554C3.67969 11.2481 3.39857 11.1317 3.10545 11.1317H3.10495ZM21.3944 11.1317C21.1012 11.1317 20.8201 11.2481 20.6129 11.4554C20.4056 11.6627 20.2891 11.9438 20.2891 12.2369C20.2891 12.53 20.4056 12.8111 20.6129 13.0184C20.8201 13.2257 21.1012 13.3421 21.3944 13.3421C21.6875 13.3421 21.9686 13.2257 22.1759 13.0184C22.3831 12.8111 22.4996 12.53 22.4996 12.2369C22.4996 11.9438 22.3831 11.6627 22.1759 11.4554C21.9686 11.2481 21.6875 11.1317 21.3944 11.1317ZM5.77586 7.91115C5.48314 7.91115 5.20157 8.02751 4.9938 8.23502C4.78603 8.44253 4.66954 8.72466 4.66954 9.0178C4.66954 9.31094 4.78603 9.59207 4.9938 9.79958C5.20157 10.0071 5.48314 10.1235 5.77586 10.1235C6.06858 10.1235 6.35014 10.0071 6.55791 9.79958C6.76568 9.59207 6.88218 9.31094 6.88218 9.0178C6.88218 8.72466 6.76568 8.44253 6.55791 8.23502C6.35014 8.02751 6.06858 7.91115 5.77586 7.91115ZM18.6794 7.91115C18.3867 7.91115 18.1051 8.02751 17.8974 8.23502C17.6897 8.44253 17.5732 8.72466 17.5732 9.0178C17.5732 9.31094 17.6897 9.59207 17.8974 9.79958C18.1051 10.0071 18.3867 10.1235 18.6794 10.1235C18.972 10.1235 19.2537 10.0071 19.461 9.79958C19.6683 9.59207 19.7848 9.31094 19.7848 9.0178C19.7848 8.72466 19.6683 8.44253 19.461 8.23502C19.2537 8.02751 18.972 7.91115 18.6794 7.91115Z" fill="black"/%3E%3C/g%3E%3Cdefs%3E%3CclipPath id="clip0_802_7212"%3E%3Crect width="24" height="24"/%3E%3C/clipPath%3E%3C/defs%3E%3C/svg%3E');
  background-size: contain; /* Adjust as needed */
  background-repeat: no-repeat; /* Prevents the background from repeating */
  width: 100px; /* Adjust size */
  height: 100px; /* Adjust size */
}

</style>
